app/views/resources/show.html.erb

SELECT  1 AS one FROM "comments" WHERE "comments"."resource_id" = ? LIMIT 1  [["resource_id", 2]]
SELECT "comments".* FROM "comments" WHERE "comments"."resource_id" = ?  ORDER BY "comments"."created_at" DESC  [["resource_id", 2]]
---
<tr class="bottom">
  <% if @resource.comments.any? %>