app/controllers/comments_controller.rb

  def new
    @resource = Resource.find_by(id: params[:resource])
---
SELECT  "resources".* FROM "resources" WHERE "resources"."id" = ? LIMIT 1  [["id", 2]]