app/controllers/comments_controller.rb

SELECT  "resources".* FROM "resources" WHERE "resources"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "comments" ("content", "rating", "user_id", "resource_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["content", "comment"], ["rating", 5], ["user_id", 2], ["resource_id", 2], ["created_at", "2015-08-07 15:21:48.553890"], ["updated_at", "2015-08-07 15:21:48.553890"]]
---
  def create
    @resource = Resource.find(params[:resource_id])
    @comment = @resource.comments.create(comment_params)