app/controllers/resources_controller.rb

SELECT  "resources".* FROM "resources" WHERE "resources"."id" = ? LIMIT 1  [["id", 7]]
SELECT "comments".* FROM "comments" WHERE "comments"."resource_id" = ?  ORDER BY "comments"."created_at" DESC  [["resource_id", 2]]
SELECT AVG(rating) FROM "resources"
---
  def show
    @resource = Resource.find(params[:id])
    @category_id = @resource.category_id
    @category_name = Resource.names.key(@category_id)
    @comments = @resource.comments.all

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
SELECT "resources".* FROM "resources" WHERE (category_id = '0')
---
  def index
    @category_id = params[:category].to_i
    @category_name = Resource.names.key(@category_id)
    @resources = Resource.where("category_id = ?", @category_id)

INSERT INTO "resources" ("name", "email", "position", "location", "company", "website", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @resource = Resource.new(resource_params)
    @comment = @resource.comments.create(comment_params)